{
  "go to editor": "Перейти к редактору",
  "graphiql descr": "GraphiQL это песочница/IDE для GraphQL запросов",
  "graphiql text": "GraphiQL — это песочница для составления, редактирования и отправки GraphQL запросов к серверному API и получения ответов на них. Наше приложение также позволяет указывать переменные и хедеры и добавлять их в запрос. Пользователь также может получить схему АПИ с помощью интроспективного запроса. Для осуществления валидации мы всегда получаем схему при загрузке редактора.",
  "graphiql link text": "Сайт GraphQL",
  "pokemon descr": "Объемный Pokemon GraphQL API",
  "pokemon text": "GraphQL-Pokemon это GraphQL API, предоставляющий обширную базу данных о покеманах. В отличие от многих современных API этот API сфокусирован на скорости, точности и качестве предоставляемых данных. API предоставляет полностью сгенерирированную для клиента TypeScript типизацию, изображения, информацию о различных ассетах покемонов: Pokedex, Items, AbilitiesMoves, Learnsets, Type matchups",
  "pokemon link text": "Документация API",
  "monaco title": "Monaco Editor для React",
  "monaco text": " Мы используем Monaco Editor для React в нашем приложении. monaco-editor - это широко изветный редактор кода, который используется в VS Code. Данная библиотека управляет управляет процессом запуска и настройки monaco-editor и предоставляет удобный API для взаимодействия с monaco из любого React окружения",
  "docs title": "Секция с документацией",
  "docs descr": "Видна только когда приложение получает успешный ответ со схемой от API",
  "docs text": "Чтобы получить успешный ответ со нужной схемой, на API нужно отправить запрос с  интроспективной квери-строкой с пустым объектом переменных. Интроспективная квери-строка -  официальная возможность GraphQL для получения схемы. Здесь приведен пример интроспективной квери-строки для SDL запроса. Вы можете написать свой интроспективный запрос или прочитать подробнее о них в официальной документации GraphQL.",
  "docs link text": "Интроспекция",
  "rs descr": "RS School это бесплатная коммьюнити-школа, поддерживаемая самими же разработчикаами, закончившими/продолжающими обучаться в ней. Проект существует с 2013 года.",
  "rs text": "Каждый может учиться в RS School независимо от возраста, текущей работы или места проживания. Ментора и тренеры школы является фронтэнд разработчиками из разных компаний и стран.",
  "rs link text": "Сайт RS School",
  "react title": "Курс по React",
  "react descr": "Бесплатно | Онлайн | На английском",
  "react text": "Курс начался 13 марта 2023 г. и закончился 22 мая 2023 г. Этот курс предназначен для студентов RS School, прошедших RS School stage #2, и для новых студентов. 11 недель отводится на изучение React и еще 3 недели на финальную реализацию задачи. Этот курс требует 20-40 часов в неделю.",
  "react link text": "Курс по React",
  "olga name": "Ольга Хмарук",
  "olga descr": "Next.js / React Typescript Node.js разработчик",
  "hleb name": "Глеб Белегов",
  "hleb descr": "Next.js / React Typescript разработчик",
  "alex name": "Olga Khmaruk",
  "alex descr": "React разработчик"
}
