{
  "go to editor": "Go to the editor",
  "graphiql descr": "GraphiQL is a playground/IDE for graphQL requests",
  "graphiql text": "GraphiQL is a sandbox for compiling, editing and sending GraphQL requests to the server API and getting responses to them. Our application also allows user to specify variables and headers and add them to the request. The user can also retrieve the API schema using an introspective query. To perform validation, we always get the schema when the editor is loaded.",
  "graphiql link text": "GraphQL Website",
  "pokemon descr": "Extensive Pokemon GraphQL API",
  "pokemon text": "GraphQL-Pokemon is a GraphQL API that provides extensive Pokémon data. Unlike contemporary APIs this API focusses on speed, accuracy and data quality. API provides fully generated client-side TypeScript typings, images, information about various assets in Pokemon: Pokedex, Items, AbilitiesMoves, Learnsets, Type matchups.",
  "pokemon link text": " API Documentation",
  "monaco title": "Monaco Editor for React",
  "monaco text": " We use Monaco Editor for React in our app. monaco-editor is a well-known web technology based code editor that powers VS Code. This library handles the setup process of monaco-editor and provides a clean API to interact with monaco from any React environment",
  "docs title": "Documentation section",
  "docs descr": "Visible only when app receives a successfull response with a schema definition from the API",
  "docs text": "To receive a successfull response with a schema definition you should send introspective query with empty variables object to the API. Introspective query is an official GraphQL feature for getting the schema. Here is an example of introspective query for SDL request. You may write your own introspective query or read about it in the official GraphQL Documentation.",
  "docs link text": "Introspection",
  "rs descr": "RS School is free-of-charge and community-based education program conducted by The Rolling Scopes developer community since 2013",
  "rs text": "Everyone can study at RS School, regardless of age, professional employment, or place of residence. The mentors and trainers of our school are front-end and javascript developers from different companies and countries.",
  "rs link text": "RS School website",
  "react title": "React course",
  "react descr": "Free | Online | In english",
  "react text": "Course started 13th of March, 2023 and ended 22nd of May, 2023. This course is aimed to the students of the RS School which passed RS School stage #2 and for the new students. 11 weeks are devoted to studying React and 3 more weeks to final task implementation. This course requires 20-40 hours per week.",
  "react link text": "React course",
  "olga name": "Olga Khmaruk",
  "olga descr": "Next.js / React Typescript Node.js developer",
  "hleb name": "Hleb Belehau",
  "hleb descr": "Next.js / React Typescript developer",
  "alex name": "Olga Khmaruk",
  "alex descr": "React developer"
}
